# Задача про журавликов

s = int(input('Введите общее число журавликов: ')) // 3

ser = s // 2
pet = ser
ekat = s * 2

print(ser, ekat, pet)
